mysensors-rus/nRF5-SDK-for-Thread-and-Zigbee-3.1/examples/multiprotocol/ble_thread/ble_thread_swi_mtd_coap_cli/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    switch (m_connection_state)
    {
        case CONNECTION_STATE_IDLE:
        case CONNECTION_STATE_BLE_DISABLE:
            break;

        case CONNECTION_STATE_BLE:
        case CONNECTION_STATE_BLE_DISCONNECT:
        case CONNECTION_STATE_BLE_DISCONNECTING:
        {
            uint32_t err_code = sd_app_evt_wait();
            APP_ERROR_CHECK(err_code);
            break;
        }

        case CONNECTION_STATE_THREAD_ATTACH:
        case CONNECTION_STATE_THREAD_SEND:
        case CONNECTION_STATE_THREAD_SENT:
        case CONNECTION_STATE_THREAD_DISABLE:
        {
            otInstance * p_instance = thread_ot_instance_get();

            if (!otTaskletsArePending(p_instance) &&
                ((otPlatRadioGetState(p_instance) == OT_RADIO_STATE_SLEEP) ||
                 (otPlatRadioGetState(p_instance) == OT_RADIO_STATE_DISABLED)))
            {
                __WFE();
            }

            break;
        }
    }
}


/**@brief Disable BLE stack.
 */
static void ble_stack_deinit(void)
{
    uint32_t err_code;

    err_code = nrf_sdh_disable_request();
    APP_ERROR_CHECK(err_code);

    // Neither SoftDevice clears clock events after disabling, nor clock driver before enabling.
    // When the clock driver is enabled there is a pending event in the clock peripheral that leads
    // to incorrect state of the driver. Following workaround prevents this problem.
    nrf_clock_event_clear(NRF_CLOCK_EVENT_HFCLKSTARTED);

    err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function called when the Thread node changes it's state.
 */
static void thread_state_changed_callback(uint32_t aFlags, void *aContext)
{
    uint32_t err_code;

    if (aFlags & OT_CHANGED_THREAD_ROLE)
    {
        switch (otThreadGetDeviceRole(aContext))
        {
            case OT_DEVICE_ROLE_DETACHED:
            case OT_DEVICE_ROLE_DISABLED:
                err_code = bsp_indication_set(BSP_THREAD_ENABLE);
                APP_ERROR_CHECK(err_code);
                break;

            case OT_DEVICE_ROLE_CHILD:
                err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
                APP_ERROR_CHECK(err_code);

                if (m_connection_state == CONNECTION_STATE_THREAD_ATTACH)
                {
                    m_connection_state = CONNECTION_STATE_THREAD_SEND;
                }
                break;

            default:
                break;
        }
    }
}


/**@brief Enter sending CoAP request state.
 */
static void thread_message_start_sending(void)
{
    NRF_LOG_INFO("Start swithing to Thread protocol");

    if (m_connection_state != CONNECTION_STATE_BLE)
    {
        return;
    }

    if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        m_connection_state = CONNECTION_STATE_BLE_DISCONNECT;
    }
    else
    {
        m_connection_state = CONNECTION_STATE_BLE_DISABLE;
    }
}


/**@brief Send CoAP request using Thread network.
 */
static void thread_message_send(uint8_t command)
{
    thread_coap_utils_multicast_light_request_send(command,
                                                   THREAD_COAP_UTILS_MULTICAST_LINK_LOCAL);
    m_connection_state = CONNECTION_STATE_THREAD_SENT;
}


/**@brief Thread connection expired.
 */
static void thread_timeout(void * p_context)
{
    (void) p_context;

    m_connection_state = CONNECTION_STATE_THREAD_DISABLE;
}


/**@brief Execute appropriate action for current application state.
 */
static void application_fsm_process(void)
{
    uint32_t     err_code;

    switch (m_connection_state)
    {
        case CONNECTION_STATE_BLE_DISCONNECT:
            NRF_LOG_INFO("Disconnecting from BLE connection");

            m_connection_state = CONNECTION_STATE_BLE_DISCONNECTING;

            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case CONNECTION_STATE_BLE_DISABLE:
            switch_ble_to_thread();

            err_code = app_timer_start(m_thread_timeout, THREAD_TIMEOUT, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case CONNECTION_STATE_THREAD_ATTACH:
            thread_process();
            break;

        case CONNECTION_STATE_THREAD_SEND:
            thread_message_send(THREAD_COAP_UTILS_LIGHT_CMD_TOGGLE);
            thread_process();
            break;

        case CONNECTION_STATE_THREAD_SENT:
        {
            otInstance * p_instance = thread_ot_instance_get();
            err_code = app_timer_stop(m_thread_timeout);
            APP_ERROR_CHECK(err_code);

            if (!otTaskletsArePending(p_instance)    &&
                !otLinkIsInTransmitState(p_instance) &&
                ((otPlatRadioGetState(p_instance) == OT_RADIO_STATE_SLEEP) ||
                 (otPlatRadioGetState(p_instance) == OT_RADIO_STATE_DISABLED)))
            {
                m_connection_state = CONNECTION_STATE_THREAD_DISABLE;
            }
            else
            {
                thread_process();
                break;
            }
        }
        // fall through

        case CONNECTION_STATE_THREAD_DISABLE:
            switch_thread_to_ble();
            break;

        default:
            break;
    }
}

/**@brief Initialize the Thread stack.
 */
static void thread_instance_init(void)
{
    uint32_t err_code;

    thread_configuration_t thread_configuration =
    {
        .radio_mode            = THREAD_RADIO_MODE_RX_OFF_WHEN_IDLE,
        .autocommissioning     = true,
        .poll_period           = 60000,
        .default_child_timeout = 240000,
    };

    thread_init(&thread_configuration);
    thread_state_changed_callback_set(thread_state_changed_callback);

    m_connection_state = CONNECTION_STATE_THREAD_ATTACH;

