mysensors-rus/nRF5-SDK-for-Thread-and-Zigbee-3.1/examples/multiprotocol/ble_thread/ble_thread_swi_mtd_coap_cli/main.c
    err_code = bsp_indication_set(BSP_THREAD_ENABLE);
    APP_ERROR_CHECK(err_code);
}


/**@brief Initialize application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_thread_timeout, APP_TIMER_MODE_SINGLE_SHOT, thread_timeout);
    APP_ERROR_CHECK(err_code);
}

/**@brief Initialize and enable BLE stack.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);

    err_code = bsp_indication_set(BSP_BLE_ENABLE);
    APP_ERROR_CHECK(err_code);

    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();

    m_connection_state = CONNECTION_STATE_BLE;

    NRF_LOG_INFO("BLE UART Start!\r\n");
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing scheduler module.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Switch from BLE to Thread.
 */
static void switch_ble_to_thread(void)
{

    ASSERT(m_connection_state == CONNECTION_STATE_BLE_DISABLE);

    ble_stack_deinit();
    thread_instance_init();
}


/**@brief Switch from Thread to BLE.
 */
static void switch_thread_to_ble(void)
{
    ASSERT(m_connection_state == CONNECTION_STATE_THREAD_DISABLE);

    thread_deinit();
    ble_stack_init();
}


/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    scheduler_init();
    timers_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();

    // Start execution.
    NRF_LOG_INFO("BLE Thread switched MTD example started.");

    // Enter main loop.
    for (;;)
    {
        application_fsm_process();
        app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
